{
  "backend/main.mo": "Motoko actor implementing prediction submission with rule-based concern level logic, storing predictions in a Map, and providing query endpoints for analytics (count, distribution, filtering by age/gender/concern).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Home page, Predict form, Results display, Model Insights, Admin Dashboard, and About page with associated files and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing routing, pages, components, charts, hooks, and utilities with focus on AdPersuasiveness type imports and Canvas-based chart implementations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the AdAware application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (Home, Predict, Results, Model Insights, Admin, About) wrapped in Layout and PredictionProvider context.",
  "frontend/src/components/charts/AgeGroupAnalysis.tsx": "Canvas-based stacked bar chart visualizing prediction distribution across three age groups (13-15, 16-18, 19+) with color-coded concern levels and legend.",
  "frontend/src/components/charts/ConcernDistributionPie.tsx": "React component that renders a pie chart on a canvas showing the distribution of low, medium, and high concern levels with percentages and a legend.",
  "frontend/src/components/charts/ConfusionMatrix.tsx": "React component that renders a 3x3 confusion matrix visualization using mock data to compare predicted vs actual concern levels (Low/Medium/High) as grouped bar charts.",
  "frontend/src/components/charts/FeatureImportance.tsx": "React component that displays horizontal bar charts showing mock feature importance scores for various factors like ad persuasiveness, frequency, screen time, etc.",
  "frontend/src/components/charts/GenderBiasChart.tsx": "React component that visualizes concern level distribution comparison between male and female predictions using grouped bar charts with percentage values.",
  "frontend/src/components/charts/ModelComparison.tsx": "React component that renders grouped bar charts comparing performance metrics (Accuracy, Precision, Recall, F1 Score) between Random Forest and Logistic Regression models using mock data.",
  "frontend/src/components/DownloadPDFButton.tsx": "Button component that triggers text-based report generation via pdfGenerator utility, accepting prediction data with concern level, recommendation, and all seven input fields.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that includes navigation, main content area, and a footer with links, project info, and attribution to caffeine.ai.",
  "frontend/src/components/layout/Navigation.tsx": "Responsive navigation bar component with desktop and mobile (sheet) views, displaying nav items and highlighting the current route.",
  "frontend/src/components/PredictionContext.tsx": "React Context provider managing prediction state (concern level, recommendation, and seven input fields) shared across components, with custom hook for consumption.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages actor creation with Internet Identity authentication, returning an authenticated or anonymous actor and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminAnalytics.ts": "Custom React hook that fetches admin analytics data including total predictions, concern distribution, and breakdowns by age group and gender using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePrediction.ts": "React Query mutation hook for submitting prediction requests to the backend actor with demographic and ad exposure parameters, returning concern level and recommendation while invalidating analytics queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom health-tech color palette (teal/green primary colors), dark mode support, chart colors, and utility classes for transitions and concern badge styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/AboutProject.tsx": "About page describing AdAware project objectives, Random Forest ML pipeline architecture, training process, SHAP explainability methodology, and ethical AI considerations for adolescent health protection.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin analytics dashboard displaying total predictions, concern level distribution pie chart, age group analysis, and gender bias comparison charts using data from useAdminAnalytics hook.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, project description, and feature cards highlighting ML prediction, SHAP explainability, and personalized health recommendations with navigation to prediction and about pages.",
  "frontend/src/pages/ModelInsights.tsx": "Displays model performance metrics (accuracy, precision, recall, F1) for Random Forest and Logistic Regression, with cards for confusion matrix, feature importance, and model comparison charts.",
  "frontend/src/pages/Predict.tsx": "Prediction form page with 7 input fields (age group, gender, screen time, platform, frequency, ad type, ad persuasiveness) that submits data to backend and navigates to results page.",
  "frontend/src/pages/Results.tsx": "Displays prediction results including concern level badge, recommendation text, input summary table, and download PDF button; redirects to predict page if no prediction data exists.",
  "frontend/src/types/AdPersuasiveness.ts": "Type definition and enum for AdPersuasiveness (low, medium, high) extracted from backend Prediction interface.",
  "frontend/src/utils/pdfGenerator.ts": "Generates text-based prediction report with concern level, recommendations, input summary, and SHAP insights explanation; downloads as .txt file.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme for charts/sidebar, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata defining AdAware as an explainable AI framework with Flask backend, Random Forest model, SHAP explainability, architectural notes, image requirements, and existing feature list."
}